; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 285838 2 2 4 7 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	infrared3 - mode
	spectrograph0 - mode
	image2 - mode
	infrared1 - mode
	GroundStation0 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation6 - direction
	Star4 - direction
	GroundStation5 - direction
	GroundStation1 - direction
	Phenomenon7 - direction
	Star8 - direction
	Planet9 - direction
	Star10 - direction
	Star11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation5)
	(supports instrument1 image2)
	(supports instrument1 infrared1)
	(supports instrument1 infrared3)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation5)
)
(:goal (and
	(pointing satellite1 Phenomenon7)
	(have_image Phenomenon7 spectrograph0)
	(have_image Star8 infrared1)
	(have_image Planet9 infrared3)
	(have_image Star10 image2)
	(have_image Star11 infrared1)
	(have_image Planet12 image2)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 7
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
3. (turn_to satellite1 star8 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 star8)
   goals met: 0 of 7
4. (calibrate satellite0 instrument0 groundstation5)
   added: (calibrated instrument0)
   goals met: 0 of 7
5. (turn_to satellite1 groundstation1 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 groundstation1)
   goals met: 0 of 7
6. (turn_to satellite0 phenomenon7 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 phenomenon7)
   goals met: 0 of 7
7. (calibrate satellite1 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 0 of 7
8. (take_image satellite0 phenomenon7 instrument0 spectrograph0)
   added: (have_image phenomenon7 spectrograph0)
   goals met: 1 of 7
9. (turn_to satellite1 star8 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 star8)
   goals met: 1 of 7
10. (take_image satellite1 star8 instrument1 infrared1)
   added: (have_image star8 infrared1)
   goals met: 2 of 7
11. (turn_to satellite1 star11 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star11)
   goals met: 2 of 7
12. (take_image satellite1 star11 instrument1 infrared1)
   added: (have_image star11 infrared1)
   goals met: 3 of 7
13. (turn_to satellite1 star10 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star10)
   goals met: 3 of 7
14. (take_image satellite1 star10 instrument1 image2)
   added: (have_image star10 image2)
   goals met: 4 of 7
15. (turn_to satellite1 planet9 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 planet9)
   goals met: 4 of 7
16. (take_image satellite1 planet9 instrument1 infrared3)
   added: (have_image planet9 infrared3)
   goals met: 5 of 7
17. (turn_to satellite1 planet12 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 planet12)
   goals met: 5 of 7
18. (take_image satellite1 planet12 instrument1 image2)
   added: (have_image planet12 image2)
   goals met: 6 of 7
19. (turn_to satellite1 phenomenon7 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 phenomenon7)
   goals met: 7 of 7
